eisup_2019_docmng_integration/src/Documents/ttk_РаспоряжениеНаЗакупку/ttk_РаспоряжениеНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_РаспоряжениеНаЗакупку</name>
  <registerRecords>AccumulationRegister.ttk_ОстаткиЛимитовПоДоговорам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРаспоряжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодКонтроля</name>
    <comment>1-по текущему договору; 2-по основному договору</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/Catalogs/ХранилищеДополнительнойИнформации/ХранилищеДополнительнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеДополнительнойИнформации</name>
  <comment>Хранилище дополнительной информации</comment>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Объект</comment>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
      <types>DocumentRef.ttk_УстановкаСоответствияНоменклатурыБюджетнымАналитикам</types>
      <types>CatalogRef.СерииНоменклатуры</types>
      <types>DocumentRef.АктОбОказанииПроизводственныхУслуг</types>
      <types>DocumentRef.абс_ЗадачаВТехподдержку</types>
      <types>CatalogRef.Территории</types>
      <types>DocumentRef.ВнутреннееПеремещениеСредствПриБюджетировании</types>
      <types>DocumentRef.абс_ЗадачаТЭО</types>
      <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      <types>DocumentRef.абс_ПоступлениеУниверсальныйСклад</types>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>DocumentRef.ТребованиеНакладная</types>
      <types>CatalogRef.абс_ТЭО</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>DocumentRef.абс_РаспределяемыеДоходыРасходы</types>
      <types>DocumentRef.абс_ПеремещениеУниверсальныйСклад</types>
      <types>CatalogRef.ЗаявкиКандидатов</types>
      <types>DocumentRef.абс_РезервыПроизведенныхРасходов</types>
      <types>CatalogRef.ОсновныеСредства</types>
      <types>DocumentRef.ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.абс_НеотфактурованнаяПоставка</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
      <types>DocumentRef.ПередачаТоваров</types>
      <types>DocumentRef.абс_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.абс_ИзменениеКонтрагентаВДоговоре</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.абс_ПлановыеРегламентныеРаботы</types>
      <types>DocumentRef.ПеремещениеМатериаловВЭксплуатации</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>CatalogRef.Помещения</types>
      <types>DocumentRef.ttk_РаспоряжениеНаЗакупку</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеМатериаловИзЭксплуатации</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ВозвратПереданныхТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВЭксплуатацию</types>
      <types>DocumentRef.абс_ЗакупочныйЗаказ</types>
      <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.абс_РеклассификацияБюджета</types>
      <types>DocumentRef.КорректировкаПоступления</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>CatalogRef.Контрагенты</types>
      <types>DocumentRef.ttk_ПроектКорректировкиДога</types>
      <types>CatalogRef.РасходыБудущихПериодов</types>
      <types>DocumentRef.абс_ЗаявкаНаДобавлениеИзменениеПрав</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>CatalogRef.Организации</types>
      <types>DocumentRef.абс_ГрупповаяРеклассификацияБюджета</types>
      <types>DocumentRef.абс_ВводЗначенийПоказателейДляРасчетаКПЭ</types>
      <types>DocumentRef.Событие</types>
      <types>DocumentRef.ОтчетКомиссионераОПродажах</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
      <types>CatalogRef.КомпетенцииРаботников</types>
      <types>DocumentRef.абс_ПереносДанных</types>
      <types>DocumentRef.абс_СчетНаОплату</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.ЭлектронноеПисьмо</types>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
      <types>CatalogRef.Вакансии</types>
      <types>DocumentRef.абс_АВИЗО</types>
      <types>CatalogRef.абс_ИнструкцииПользователя</types>
      <types>DocumentRef.Абс_АктПриёмкиВыполненныхРабот</types>
      <types>BusinessProcessRef.абсЗаявкаВПоддержку</types>
      <types>CatalogRef.Номенклатура</types>
      <types>DocumentRef.абс_ВыбытиеУниверсальныйСклад</types>
      <types>DocumentRef.ПеремещениеОС</types>
      <types>DocumentRef.КомплектацияНоменклатуры</types>
      <types>DocumentRef.АктСверкиВзаиморасчетов</types>
      <types>DocumentRef.абс_ЗаявкаНаПроект</types>
      <types>DocumentRef.ПланируемоеПоступлениеДенежныхСредств</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.БюджетнаяОперация</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ПолучениеУслугПоПереработке</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПрикрепленияФайла</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИтоговыйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ИнициаторФайла</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КлючСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоСчетСканСчетаНаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЗагруженИзИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СвойствоОС</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.абс_СвойстваОС</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипДокумента</name>
    <type>
      <types>CatalogRef.абс_ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ХэшФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_СсылкаНаАналогичныйФайл</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Documents/ttk_РаспоряжениеНаЗакупку/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПроверитьНаличиеОсновногоДоговора(Договор)
	
	Если ЗначениеЗаполнено(Договор.абс_ОсновнойДоговор) Тогда
		Возврат Договор.абс_ОсновнойДоговор;
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЗаголовокГруппыЛимитов()
	
	Элементы.ГруппаЛимит.Заголовок =
		?(ЗначениеЗаполнено(Объект.ДоговорКонтрагента),
			"Лимит (в валюте договора), " + НРег(ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента, 1)),
			"Лимит (в валюте договора)");
	Если Не ЗначениеЗаполнено(Объект.Валюта) И ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Объект.Валюта = ПолучитьВалютуДоговора(Объект.ДоговорКонтрагента, 2);
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВалютуДоговора(Договор, Тип)
	
	Если Тип = 1 Тогда
		Возврат Строка(Договор.ВалютаВзаиморасчетов);
	Иначе 
		Возврат Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыНаСервере()
	
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("Дт", ТекущаяДата());
	ИсторияСогласования.Параметры.УстановитьЗначениеПараметра("РаспоряжениеНаЗакупку", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	
	//Элементы.Проект.ТолькоПросмотр = Истина;	
	//
	//УстановитьТолькоПросмотрВсемЭлементам(Ложь);
	//Если не мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.Подготовка") Тогда
	//	
	//	УстановитьТолькоПросмотрВсемЭлементам();
	//	
	//	Если мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.СогласованиеДЭИ") Тогда
	//		Элементы.ДоходыПроектов.ТолькоПросмотр  = Ложь;
	//		Элементы.РасходыПроектов.ТолькоПросмотр = Ложь;
	//		
	//	ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.СогласованиеДТР") Тогда	
	//		
	//		Элементы.ДоходыПроектов.ТолькоПросмотр 	= Ложь;
	//		
	//		
	//	ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.РазработкаТЭО") Тогда
	//		
	//		Элементы.ТЭО.ТолькоПросмотр            	= Ложь;
	//		
	//	ИначеЕсли мСтатус = ПредопределенноеЗначение("Перечисление.абс_СтатусыПроектов.Согласован") Тогда
	//		
	//		
	//		
	//	КонецЕсли;		
	//Иначе			
	//	
	//	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.абс_ВидыОперацийЗаявкаНаПроект.АктуализацияДанныхПроекта") Тогда
	//		Элементы.Проект.ТолькоПросмотр = Ложь;
	//	КонецЕсли;		
	//	
	//КонецЕсли;		
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСтатусыДокументаНаСервере()

	Документы.ttk_РаспоряжениеНаЗакупку.ЗаполнитьСписокДоступныхСтатусов(Элементы.мСтатус.СписокВыбора, Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СуммаБезНДСПриИзменении(Элемент)
	
	Объект.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Объект.СуммаБезНДС, Истина, Ложь, УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС));
	Объект.Сумма = Объект.СуммаБезНДС + Объект.СуммаНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Объект.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Объект.СуммаБезНДС, Истина, Ложь, УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС));
	Объект.Сумма = Объект.СуммаБезНДС + Объект.СуммаНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатусыДокументаНаСервере();
	мСтатус = Объект.Статус;
	ОбновитьВидимость();

	СканКопияРаспоряжения = Документы.ttk_РаспоряжениеНаЗакупку.ПолучитьСсылкуНаСканКопиюРаспоряженияИзХранилища(Объект.Ссылка);
	НаименованиеФайла = СканКопияРаспоряжения.ИмяФайла;
	ОбновитьЗаголовокГруппыЛимитов();
	
	ДоговорКонтрагентаПриИзменении(Элементы.ДоговорКонтрагента);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = (Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая());	
	УстановитьПараметрыНаСервере();	
	вСтатус = Объект.Статус;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура мСтатусПриИзменении(Элемент)
	
	ЗаполнитьСтатусыДокументаНаСервере();
	Объект.Статус = мСтатус;	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьВидимость();
	УстановитьПараметрыНаСервере();
	Элементы.ИсторияСогласования.Обновить();
	ЗаполнитьСтатусыДокументаНаСервере();
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если вСтатус <> Объект.Статус Тогда
		ПричинаИзмененияСтатуса = "";
		Если ВвестиСтроку(ПричинаИзмененияСтатуса, "Укажите причину изменения статуса.", , Истина) Тогда
			Объект.ПричинаИзмененияСтатуса = ПричинаИзмененияСтатуса;
		Иначе 
			мСтатус = вСтатус;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СканКопияРаспоряженияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	Если Не ЗначениеЗаполнено(СканКопияРаспоряжения) Тогда
		Возврат;
	КонецЕсли;
	
	ОткликФормы = Обработки.МенеджерКонтактов.ПолучитьФорму("ФормаОткрытияВложений").ОткрытьМодально();
	
	Если ОткликФормы = Неопределено ИЛИ ТипЗнч(ОткликФормы) <> Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОткликФормы Тогда		
		Файл = абс_РаботаСФайлами.ПолучитьФайлИзВнешнегоХранилища(СканКопияРаспоряжения);		
		ПолныйПутьКФайлу = ПолучитьИмяВременногоФайла(РаботаСфайлами.ПолучитьРасширениеФайла(СканКопияРаспоряжения.Наименование));		
		Файл.Записать(ПолныйПутьКфайлу);		
		ЗапуститьПриложение("" + ПолныйПутьКфайлу);		
	Иначе		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогВыбораФайла.Заголовок               = "Обзор...";		
		Если ДиалогВыбораФайла.Выбрать() Тогда			
			КаталогСохранения = ДиалогВыбораФайла.Каталог;			
			Файл = абс_РаботаСФайлами.ПолучитьФайлИзВнешнегоХранилища(СканКопияРаспоряжения);			
			Файл.Записать(КаталогСохранения + "\" + СканКопияРаспоряжения.Наименование);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СканКопияРаспоряженияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		Возврат;
	КонецЕсли;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                  = "Все файлы (*.*)|*.*";
	ДиалогВыбораФайла.Заголовок               = "Обзор...";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Если НЕ Документы.ttk_РаспоряжениеНаЗакупку.ПроверитьРасширениеФайла(ДиалогВыбораФайла.ПолноеИмяФайла) Тогда
			Возврат;
		КонецЕсли;		
		Наименование = СтрЗаменить(ДиалогВыбораФайла.ПолноеИмяФайла, ДиалогВыбораФайла.Каталог, "");
		ВнешнийФайл = Новый ДвоичныеДанные(ДиалогВыбораФайла.ПолноеИмяФайла);		
		РезультатЗаписи = абс_РаботаСФайлами.ЗаписатьФайлВоВнешнееХранилище(Объект.Ссылка, ВнешнийФайл, Наименование, , );
		
		Если РезультатЗаписи.Успешно Тогда
			НаименованиеФайла = Наименование;
			СканКопияРаспоряжения = РезультатЗаписи.ХранилищеСсылка;
			
			Если ТипЗнч(СканКопияРаспоряжения) = Тип("СправочникСсылка.ХранилищеДополнительнойИнформации") Тогда
				обХранилище = СканКопияРаспоряжения.ПолучитьОбъект();
				обХранилище.абс_ТипДокумента = Справочники.абс_ТипыДокументов.РаспоряжениеНаЗакупку;
				обХранилище.Записать();
			КонецЕсли;
		
			НайденныйФайлПоДоговору = Документы.ttk_РаспоряжениеНаЗакупку.ПолучитьСсылкуНаСканКопиюРаспоряженияИзХранилища(Объект.ДоговорКонтрагента, Наименование);
			Если НайденныйФайлПоДоговору = Справочники.ХранилищеДополнительнойИнформации.ПустаяСсылка() Тогда
				ТекущийФайлПоДоговору = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
				ТекущийФайлПоДоговору.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
				ТекущийФайлПоДоговору.ИмяФайла = СканКопияРаспоряжения.ИмяФайла; //ДиалогВыбораФайла.ПолноеИмяФайла;
				ТекущийФайлПоДоговору.Наименование = СканКопияРаспоряжения.Наименование;
				ТекущийФайлПоДоговору.абс_ТипДокумента = Справочники.абс_ТипыДокументов.РаспоряжениеНаЗакупку;
				ТекущийФайлПоДоговору.Объект = Объект.ДоговорКонтрагента;
				ТекущийФайлПоДоговору.абс_ДатаПрикрепленияФайла = СканКопияРаспоряжения.абс_ДатаПрикрепленияФайла;
			Иначе
				ТекущийФайлПоДоговору = НайденныйФайлПоДоговору.ПолучитьОбъект();
			КонецЕсли;
			ТекущийФайлПоДоговору.Записать();			
			
			Если Объект.МетодКонтроля = 2 И ЗначениеЗаполнено(ОсновнойДоговор) Тогда
				НайденныйФайлПоОсновномуДоговору = Документы.ttk_РаспоряжениеНаЗакупку.ПолучитьСсылкуНаСканКопиюРаспоряженияИзХранилища(ОсновнойДоговор, Наименование);
				Если НайденныйФайлПоОсновномуДоговору = Справочники.ХранилищеДополнительнойИнформации.ПустаяСсылка() Тогда
					ТекущийФайлПоОсновномуДоговору = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
					ТекущийФайлПоОсновномуДоговору.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
					ТекущийФайлПоОсновномуДоговору.ИмяФайла = СканКопияРаспоряжения.ИмяФайла;
					ТекущийФайлПоОсновномуДоговору.Наименование = СканКопияРаспоряжения.Наименование;
					ТекущийФайлПоОсновномуДоговору.абс_ТипДокумента = Справочники.абс_ТипыДокументов.РаспоряжениеНаЗакупку;
					ТекущийФайлПоОсновномуДоговору.Объект = ОсновнойДоговор;
					ТекущийФайлПоОсновномуДоговору.абс_ДатаПрикрепленияФайла = СканКопияРаспоряжения.абс_ДатаПрикрепленияФайла;
				Иначе
					ТекущийФайлПоОсновномуДоговору = НайденныйФайлПоОсновномуДоговору.ПолучитьОбъект();
				КонецЕсли;
				ТекущийФайлПоОсновномуДоговору.Записать();			
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	Объект.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Объект.Сумма, Истина, Истина, УчетНДС.ПолучитьСтавкуНДС(Объект.СтавкаНДС));
	Объект.СуммаБезНДС = Объект.Сумма - Объект.СуммаНДС;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	ОбновитьЗаголовокГруппыЛимитов();
	
	ОсновнойДоговор = ПроверитьНаличиеОсновногоДоговора(Объект.ДоговорКонтрагента);
	Если Не ЗначениеЗаполнено(ОсновнойДоговор) Тогда
		Элементы.МетодКонтроля.Доступность = Ложь;
		Объект.МетодКонтроля = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОсновнойДоговор", ОсновнойДоговор);
	
КонецПроцедуры
